node {
  name: "rgb_in"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 352
        }
        dim {
          size: 1216
        }
        dim {
          size: 3
        }
      }
    }
  }
}
node {
  name: "depth_in"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 352
        }
        dim {
          size: 1216
        }
        dim {
          size: 1
        }
      }
    }
  }
}
node {
  name: "decalib_in"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 16
        }
      }
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-conv1/weights/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-conv1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\013\000\000\000\013\000\000\000\003\000\000\000`\000\000\000"
      }
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-conv1/weights/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-conv1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.022380271926522255
      }
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-conv1/weights/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-conv1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.022380271926522255
      }
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-conv1/weights/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-conv1/weights/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-conv1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-conv1/weights/Initializer/random_uniform/sub"
  op: "Sub"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-conv1/weights/Initializer/random_uniform/max"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-conv1/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-conv1/weights"
      }
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-conv1/weights/Initializer/random_uniform/mul"
  op: "Mul"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-conv1/weights/Initializer/random_uniform/RandomUniform"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-conv1/weights/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-conv1/weights"
      }
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-conv1/weights/Initializer/random_uniform"
  op: "Add"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-conv1/weights/Initializer/random_uniform/mul"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-conv1/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-conv1/weights"
      }
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-conv1/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-conv1/weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 11
        }
        dim {
          size: 11
        }
        dim {
          size: 3
        }
        dim {
          size: 96
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-conv1/weights/Assign"
  op: "Assign"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-conv1/weights"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-conv1/weights/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-conv1/weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-conv1/weights/read"
  op: "Identity"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-conv1/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-conv1/weights"
      }
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-conv1/biases/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-conv1/biases"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 96
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-conv1/biases"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-conv1/biases"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 96
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-conv1/biases/Assign"
  op: "Assign"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-conv1/biases"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-conv1/biases/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-conv1/biases"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-conv1/biases/read"
  op: "Identity"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-conv1/biases"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-conv1/biases"
      }
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-conv1/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-conv1/Conv2D"
  op: "Conv2D"
  input: "rgb_in"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-conv1/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 4
        i: 4
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-conv1/BiasAdd"
  op: "BiasAdd"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-conv1/Conv2D"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-conv1/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-conv1/Relu"
  op: "Relu"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-conv1/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp1/weights/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000`\000\000\000`\000\000\000"
      }
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp1/weights/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.1767766922712326
      }
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp1/weights/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.1767766922712326
      }
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp1/weights/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp1/weights/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp1/weights/Initializer/random_uniform/sub"
  op: "Sub"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp1/weights/Initializer/random_uniform/max"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp1/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp1/weights"
      }
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp1/weights/Initializer/random_uniform/mul"
  op: "Mul"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp1/weights/Initializer/random_uniform/RandomUniform"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp1/weights/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp1/weights"
      }
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp1/weights/Initializer/random_uniform"
  op: "Add"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp1/weights/Initializer/random_uniform/mul"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp1/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp1/weights"
      }
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp1/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp1/weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 96
        }
        dim {
          size: 96
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp1/weights/Assign"
  op: "Assign"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp1/weights"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp1/weights/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp1/weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp1/weights/read"
  op: "Identity"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp1/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp1/weights"
      }
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp1/biases/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp1/biases"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 96
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp1/biases"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp1/biases"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 96
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp1/biases/Assign"
  op: "Assign"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp1/biases"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp1/biases/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp1/biases"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp1/biases/read"
  op: "Identity"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp1/biases"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp1/biases"
      }
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp1/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp1/Conv2D"
  op: "Conv2D"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-conv1/Relu"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp1/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp1/BiasAdd"
  op: "BiasAdd"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp1/Conv2D"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp1/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp1/Relu"
  op: "Relu"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp1/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp2/weights/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp2/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000`\000\000\000`\000\000\000"
      }
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp2/weights/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp2/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.1767766922712326
      }
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp2/weights/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp2/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.1767766922712326
      }
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp2/weights/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp2/weights/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp2/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp2/weights/Initializer/random_uniform/sub"
  op: "Sub"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp2/weights/Initializer/random_uniform/max"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp2/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp2/weights"
      }
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp2/weights/Initializer/random_uniform/mul"
  op: "Mul"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp2/weights/Initializer/random_uniform/RandomUniform"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp2/weights/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp2/weights"
      }
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp2/weights/Initializer/random_uniform"
  op: "Add"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp2/weights/Initializer/random_uniform/mul"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp2/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp2/weights"
      }
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp2/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp2/weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 96
        }
        dim {
          size: 96
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp2/weights/Assign"
  op: "Assign"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp2/weights"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp2/weights/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp2/weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp2/weights/read"
  op: "Identity"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp2/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp2/weights"
      }
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp2/biases/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp2/biases"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 96
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp2/biases"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp2/biases"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 96
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp2/biases/Assign"
  op: "Assign"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp2/biases"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp2/biases/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp2/biases"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp2/biases/read"
  op: "Identity"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp2/biases"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp2/biases"
      }
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp2/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp2/Conv2D"
  op: "Conv2D"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp1/Relu"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp2/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp2/BiasAdd"
  op: "BiasAdd"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp2/Conv2D"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp2/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp2/Relu"
  op: "Relu"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp2/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-max/MaxPool"
  op: "MaxPool"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-cccp2/Relu"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "ksize"
    value {
      list {
        i: 1
        i: 3
        i: 3
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-conv1/weights/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-conv1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\005\000\000\000\005\000\000\000`\000\000\000\000\001\000\000"
      }
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-conv1/weights/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-conv1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.026111647486686707
      }
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-conv1/weights/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-conv1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.026111647486686707
      }
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-conv1/weights/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-conv1/weights/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-conv1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-conv1/weights/Initializer/random_uniform/sub"
  op: "Sub"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-conv1/weights/Initializer/random_uniform/max"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-conv1/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-conv1/weights"
      }
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-conv1/weights/Initializer/random_uniform/mul"
  op: "Mul"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-conv1/weights/Initializer/random_uniform/RandomUniform"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-conv1/weights/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-conv1/weights"
      }
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-conv1/weights/Initializer/random_uniform"
  op: "Add"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-conv1/weights/Initializer/random_uniform/mul"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-conv1/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-conv1/weights"
      }
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-conv1/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-conv1/weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 5
        }
        dim {
          size: 5
        }
        dim {
          size: 96
        }
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-conv1/weights/Assign"
  op: "Assign"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-conv1/weights"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-conv1/weights/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-conv1/weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-conv1/weights/read"
  op: "Identity"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-conv1/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-conv1/weights"
      }
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-conv1/biases/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-conv1/biases"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 256
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-conv1/biases"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-conv1/biases"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-conv1/biases/Assign"
  op: "Assign"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-conv1/biases"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-conv1/biases/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-conv1/biases"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-conv1/biases/read"
  op: "Identity"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-conv1/biases"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-conv1/biases"
      }
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-conv1/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-conv1/Conv2D"
  op: "Conv2D"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n1/rfe-n1-max/MaxPool"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-conv1/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-conv1/BiasAdd"
  op: "BiasAdd"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-conv1/Conv2D"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-conv1/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-conv1/Relu"
  op: "Relu"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-conv1/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-cccp1/weights/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-cccp1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000\000\001\000\000\000\001\000\000"
      }
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-cccp1/weights/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-cccp1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.10825317353010178
      }
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-cccp1/weights/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-cccp1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.10825317353010178
      }
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-cccp1/weights/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-cccp1/weights/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-cccp1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-cccp1/weights/Initializer/random_uniform/sub"
  op: "Sub"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-cccp1/weights/Initializer/random_uniform/max"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-cccp1/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-cccp1/weights"
      }
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-cccp1/weights/Initializer/random_uniform/mul"
  op: "Mul"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-cccp1/weights/Initializer/random_uniform/RandomUniform"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-cccp1/weights/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-cccp1/weights"
      }
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-cccp1/weights/Initializer/random_uniform"
  op: "Add"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-cccp1/weights/Initializer/random_uniform/mul"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-cccp1/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-cccp1/weights"
      }
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-cccp1/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-cccp1/weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 256
        }
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-cccp1/weights/Assign"
  op: "Assign"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-cccp1/weights"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-cccp1/weights/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-cccp1/weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-cccp1/weights/read"
  op: "Identity"
  input: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-cccp1/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-cccp1/weights"
      }
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-cccp1/biases/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-cccp1/biases"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 256
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-cccp1/biases"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-cccp1/biases"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "regnet/feature_extraction/rgb_feature_extraction/rfe-n2/rfe-n2-cccp1/biases/Assign"
